In [1]:
import pandas as pd
import numpy as np

In [3]:
obj=pd.Series([1,2,3,4])

In [10]:
data={
    'kirito':{
        '2000':2.4,
        '2001':1.2
    },
    'asuna':{
        '2001':2.8,
        '2004':2.6
    }
}
exl=pd.DataFrame(data)
exl

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>kirito</th>
      <th>asuna</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>2000</th>
      <td>2.4</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>2001</th>
      <td>1.2</td>
      <td>2.8</td>
    </tr>
    <tr>
      <th>2004</th>
      <td>NaN</td>
      <td>2.6</td>
    </tr>
  </tbody>
</table>
</div>

In [11]:
pd.Index([1,2,3])

Int64Index([1, 2, 3], dtype='int64')

In [13]:
obj[1]

2

In [14]:
import pandas as pd

In [15]:
test=pd.Series([1,2,3,4],index=['a','b','c','d'])

In [16]:
test.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [17]:
test.values

array([1, 2, 3, 4], dtype=int64)

In [18]:
test['a']

1

In [20]:
test[test>2]

c    3
d    4
dtype: int64

In [21]:
import numpy as np

In [22]:
np.exp(test)

a     2.718282
b     7.389056
c    20.085537
d    54.598150
dtype: float64

In [23]:
np.sum(test)

10

In [24]:
'a' in test

True

In [27]:
a=['a','b','c']
b=[1,2,3]
dic=dict(zip(a,b))
pd.Series(dic)

a    1
b    2
c    3
dtype: int64

In [33]:
a=['a','b','c']
b=[1,2,3]
dic=dict(zip(a,b))
state=['a','b','c','d']
exl=pd.Series(dic,index=state)

In [35]:
pd.isnull(exl)

a    False
b    False
c    False
d     True
dtype: bool

In [36]:
exl.name='population'
exl.index.name='state'

In [37]:
exl

state
a    1.0
b    2.0
c    3.0
d    NaN
Name: population, dtype: float64

In [52]:
data={
    'state':['kirito','xilika','asuna'],
    'year':['2000','2001','2002'],
    'pop':[1.5,1.6,1.7]
}
exl=pd.DataFrame(data)
exl

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>pop</th>
      <th>state</th>
      <th>year</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1.5</td>
      <td>kirito</td>
      <td>2000</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1.6</td>
      <td>xilika</td>
      <td>2001</td>
    </tr>
    <tr>
      <th>2</th>
      <td>1.7</td>
      <td>asuna</td>
      <td>2002</td>
    </tr>
  </tbody>
</table>
</div>

In [59]:
exl=pd.DataFrame(data=data,columns=['year','state','pop','target'])
exl

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>year</th>
      <th>state</th>
      <th>pop</th>
      <th>target</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>2000</td>
      <td>kirito</td>
      <td>1.5</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2001</td>
      <td>xilika</td>
      <td>1.6</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>2</th>
      <td>2002</td>
      <td>asuna</td>
      <td>1.7</td>
      <td>NaN</td>
    </tr>
  </tbody>
</table>
</div>

In [50]:
exl.year

0    2000
1    2001
2    2002
Name: year, dtype: object

In [62]:
exl.target=16.6
exl

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>year</th>
      <th>state</th>
      <th>pop</th>
      <th>target</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>2000</td>
      <td>kirito</td>
      <td>1.5</td>
      <td>16.6</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2001</td>
      <td>xilika</td>
      <td>1.6</td>
      <td>16.6</td>
    </tr>
    <tr>
      <th>2</th>
      <td>2002</td>
      <td>asuna</td>
      <td>1.7</td>
      <td>16.6</td>
    </tr>
  </tbody>
</table>
</div>

In [63]:
exl.target=np.arange(3)

In [64]:
exl

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>year</th>
      <th>state</th>
      <th>pop</th>
      <th>target</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>2000</td>
      <td>kirito</td>
      <td>1.5</td>
      <td>0</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2001</td>
      <td>xilika</td>
      <td>1.6</td>
      <td>1</td>
    </tr>
    <tr>
      <th>2</th>
      <td>2002</td>
      <td>asuna</td>
      <td>1.7</td>
      <td>2</td>
    </tr>
  </tbody>
</table>
</div>

In [70]:
exl

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>year</th>
      <th>state</th>
      <th>pop</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>2000</td>
      <td>kirito</td>
      <td>1.5</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2001</td>
      <td>xilika</td>
      <td>1.6</td>
    </tr>
    <tr>
      <th>2</th>
      <td>2002</td>
      <td>asuna</td>
      <td>1.7</td>
    </tr>
  </tbody>
</table>
</div>

In [72]:
del(exl['year'])

In [73]:
exl

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>state</th>
      <th>pop</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>kirito</td>
      <td>1.5</td>
    </tr>
    <tr>
      <th>1</th>
      <td>xilika</td>
      <td>1.6</td>
    </tr>
    <tr>
      <th>2</th>
      <td>asuna</td>
      <td>1.7</td>
    </tr>
  </tbody>
</table>
</div>

In [78]:
data={
    'kirito':{
        '2000':2.4,
        '2001':1.2
    },
    'asuna':{
        '2001':2.8,
        '2004':2.6
    }
}
exl=pd.DataFrame(data)

In [79]:
exl.T

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>2000</th>
      <th>2001</th>
      <th>2004</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>asuna</th>
      <td>NaN</td>
      <td>2.8</td>
      <td>2.6</td>
    </tr>
    <tr>
      <th>kirito</th>
      <td>2.4</td>
      <td>1.2</td>
      <td>NaN</td>
    </tr>
  </tbody>
</table>
</div>

In [80]:
exl.values

array([[ nan,  2.4],
       [ 2.8,  1.2],
       [ 2.6,  nan]])

In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
obj=pd.Series(range(3),index=['a','b','c'])

In [12]:
obj_index=obj.index

In [13]:
obj_index

Index(['a', 'b', 'c'], dtype='object')

In [15]:
new_index=pd.Index(['d','e','f'])

In [16]:
obj_index.append(new_index)

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [17]:
obj

a    0
b    1
c    2
dtype: int32

In [18]:
obj.index

Index(['a', 'b', 'c'], dtype='object')

In [19]:
obj.index=new_index

In [20]:
obj.index

Index(['d', 'e', 'f'], dtype='object')

d    0
e    1
f    2
dtype: int32

In [23]:
new_index=pd.Index(['e','f','g'])

In [24]:
obj.index.append(new_index)

Index(['d', 'e', 'f', 'e', 'f', 'g'], dtype='object')

In [25]:
obj

d    0
e    1
f    2
dtype: int32

In [26]:
obj.index.unique

In [27]:
obj=pd.Series([4,5,6,7],index=['d','a','b','c'])

In [28]:
obj.index

Index(['d', 'a', 'b', 'c'], dtype='object')

In [30]:
obj.reindex(['a','b','c','d','e'])

a    5.0
b    6.0
c    7.0
d    4.0
e    NaN
dtype: float64

In [31]:
obj

d    4
a    5
b    6
c    7
dtype: int64

In [32]:
frame=pd.DataFrame(np.arange(9).reshape((3,3)),index=['a','b','c'],columns=['time','copy','paste'])

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>time</th>
      <th>copy</th>
      <th>paste</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>a</th>
      <td>0</td>
      <td>1</td>
      <td>2</td>
    </tr>
    <tr>
      <th>b</th>
      <td>3</td>
      <td>4</td>
      <td>5</td>
    </tr>
    <tr>
      <th>c</th>
      <td>6</td>
      <td>7</td>
      <td>8</td>
    </tr>
  </tbody>
</table>
</div>

In [36]:
frame2=frame.reindex(index=['b','a','c'],columns=['copy','paste','delete'])

In [37]:
frame2

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>copy</th>
      <th>paste</th>
      <th>delete</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>b</th>
      <td>4.0</td>
      <td>5.0</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>a</th>
      <td>1.0</td>
      <td>2.0</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>c</th>
      <td>7.0</td>
      <td>8.0</td>
      <td>NaN</td>
    </tr>
  </tbody>
</table>
</div>

In [39]:
obj=pd.Series(np.arange(5),index=['a','b','c','d','e'])

In [44]:
obj

b    1
c    2
d    3
e    4
dtype: int32

In [41]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [45]:
obj=pd.Series(np.arange(4),index=['a','b','c','d'])

In [49]:
obj[0:2]

a    0
b    1
dtype: int32

In [50]:
obj[['a','c','d']]

a    0
c    2
d    3
dtype: int32

In [52]:
obj['a':'d']

a    0
b    1
c    2
d    3
dtype: int32

In [55]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),
                  index=['a','b','c','d'],
                  columns=['kirito','asuna','alice','kelaiyin'])

In [57]:
data

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>kirito</th>
      <th>asuna</th>
      <th>alice</th>
      <th>kelaiyin</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>a</th>
      <td>0</td>
      <td>1</td>
      <td>2</td>
      <td>3</td>
    </tr>
    <tr>
      <th>b</th>
      <td>4</td>
      <td>5</td>
      <td>6</td>
      <td>7</td>
    </tr>
    <tr>
      <th>c</th>
      <td>8</td>
      <td>9</td>
      <td>10</td>
      <td>11</td>
    </tr>
    <tr>
      <th>d</th>
      <td>12</td>
      <td>13</td>
      <td>14</td>
      <td>15</td>
    </tr>
  </tbody>
</table>
</div>

In [64]:
data[0:3]

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>kirito</th>
      <th>asuna</th>
      <th>alice</th>
      <th>kelaiyin</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>a</th>
      <td>0</td>
      <td>1</td>
      <td>2</td>
      <td>3</td>
    </tr>
    <tr>
      <th>b</th>
      <td>4</td>
      <td>5</td>
      <td>6</td>
      <td>7</td>
    </tr>
    <tr>
      <th>c</th>
      <td>8</td>
      <td>9</td>
      <td>10</td>
      <td>11</td>
    </tr>
  </tbody>
</table>
</div>

In [65]:
data[['kirito','asuna']]

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>kirito</th>
      <th>asuna</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>a</th>
      <td>0</td>
      <td>1</td>
    </tr>
    <tr>
      <th>b</th>
      <td>4</td>
      <td>5</td>
    </tr>
    <tr>
      <th>c</th>
      <td>8</td>
      <td>9</td>
    </tr>
    <tr>
      <th>d</th>
      <td>12</td>
      <td>13</td>
    </tr>
  </tbody>
</table>
</div>

In [68]:
data[data['kirito']>5]

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>kirito</th>
      <th>asuna</th>
      <th>alice</th>
      <th>kelaiyin</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>c</th>
      <td>8</td>
      <td>9</td>
      <td>10</td>
      <td>11</td>
    </tr>
    <tr>
      <th>d</th>
      <td>12</td>
      <td>13</td>
      <td>14</td>
      <td>15</td>
    </tr>
  </tbody>
</table>
</div>

In [70]:
data['kirito']>5

a    False
b    False
c     True
d     True
Name: kirito, dtype: bool

In [71]:
data

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>kirito</th>
      <th>asuna</th>
      <th>alice</th>
      <th>kelaiyin</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>a</th>
      <td>0</td>
      <td>1</td>
      <td>2</td>
      <td>3</td>
    </tr>
    <tr>
      <th>b</th>
      <td>4</td>
      <td>5</td>
      <td>6</td>
      <td>7</td>
    </tr>
    <tr>
      <th>c</th>
      <td>8</td>
      <td>9</td>
      <td>10</td>
      <td>11</td>
    </tr>
    <tr>
      <th>d</th>
      <td>12</td>
      <td>13</td>
      <td>14</td>
      <td>15</td>
    </tr>
  </tbody>
</table>
</div>

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>kirito</th>
      <th>asuna</th>
      <th>alice</th>
      <th>kelaiyin</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>a</th>
      <td>0</td>
      <td>1</td>
      <td>2</td>
      <td>3</td>
    </tr>
    <tr>
      <th>b</th>
      <td>4</td>
      <td>5</td>
      <td>6</td>
      <td>7</td>
    </tr>
    <tr>
      <th>c</th>
      <td>8</td>
      <td>9</td>
      <td>10</td>
      <td>11</td>
    </tr>
    <tr>
      <th>d</th>
      <td>12</td>
      <td>13</td>
      <td>14</td>
      <td>15</td>
    </tr>
  </tbody>
</table>
</div>

In [74]:
data

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>kirito</th>
      <th>asuna</th>
      <th>alice</th>
      <th>kelaiyin</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>a</th>
      <td>0</td>
      <td>1</td>
      <td>2</td>
      <td>3</td>
    </tr>
    <tr>
      <th>b</th>
      <td>4</td>
      <td>5</td>
      <td>6</td>
      <td>7</td>
    </tr>
    <tr>
      <th>c</th>
      <td>8</td>
      <td>9</td>
      <td>10</td>
      <td>11</td>
    </tr>
    <tr>
      <th>d</th>
      <td>12</td>
      <td>13</td>
      <td>14</td>
      <td>15</td>
    </tr>
  </tbody>
</table>
</div>

In [80]:
data.loc['a':'d','kirito':'kelaiyin']

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>kirito</th>
      <th>asuna</th>
      <th>alice</th>
      <th>kelaiyin</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>a</th>
      <td>0</td>
      <td>1</td>
      <td>2</td>
      <td>3</td>
    </tr>
    <tr>
      <th>b</th>
      <td>4</td>
      <td>5</td>
      <td>6</td>
      <td>7</td>
    </tr>
    <tr>
      <th>c</th>
      <td>8</td>
      <td>9</td>
      <td>10</td>
      <td>11</td>
    </tr>
    <tr>
      <th>d</th>
      <td>12</td>
      <td>13</td>
      <td>14</td>
      <td>15</td>
    </tr>
  </tbody>
</table>
</div>

In [81]:
data.iloc[0:3,2:]

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>alice</th>
      <th>kelaiyin</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>a</th>
      <td>2</td>
      <td>3</td>
    </tr>
    <tr>
      <th>b</th>
      <td>6</td>
      <td>7</td>
    </tr>
    <tr>
      <th>c</th>
      <td>10</td>
      <td>11</td>
    </tr>
  </tbody>
</table>
</div>

In [82]:
df1=pd.DataFrame(np.arange(9).reshape((3,3)),columns=list('bcd'),index=['kirito','asuna','alice'])
df2=pd.DataFrame(np.arange(12).reshape((4,3)),columns=list('bde'),index=['kirito','asuna','alice','kelaiyin'])

In [83]:
df1

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>b</th>
      <th>c</th>
      <th>d</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>kirito</th>
      <td>0</td>
      <td>1</td>
      <td>2</td>
    </tr>
    <tr>
      <th>asuna</th>
      <td>3</td>
      <td>4</td>
      <td>5</td>
    </tr>
    <tr>
      <th>alice</th>
      <td>6</td>
      <td>7</td>
      <td>8</td>
    </tr>
  </tbody>
</table>
</div>

In [84]:
df2

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>b</th>
      <th>d</th>
      <th>e</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>kirito</th>
      <td>0</td>
      <td>1</td>
      <td>2</td>
    </tr>
    <tr>
      <th>asuna</th>
      <td>3</td>
      <td>4</td>
      <td>5</td>
    </tr>
    <tr>
      <th>alice</th>
      <td>6</td>
      <td>7</td>
      <td>8</td>
    </tr>
    <tr>
      <th>kelaiyin</th>
      <td>9</td>
      <td>10</td>
      <td>11</td>
    </tr>
  </tbody>
</table>
</div>

In [87]:
df3=df1+df2

In [88]:
df3

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>b</th>
      <th>c</th>
      <th>d</th>
      <th>e</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>alice</th>
      <td>12.0</td>
      <td>NaN</td>
      <td>15.0</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>asuna</th>
      <td>6.0</td>
      <td>NaN</td>
      <td>9.0</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>kelaiyin</th>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>kirito</th>
      <td>0.0</td>
      <td>NaN</td>
      <td>3.0</td>
      <td>NaN</td>
    </tr>
  </tbody>
</table>
</div>

In [91]:
df4=df1.add(df2,fill_value=0)

In [92]:
df4

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>b</th>
      <th>c</th>
      <th>d</th>
      <th>e</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>alice</th>
      <td>12.0</td>
      <td>7.0</td>
      <td>15.0</td>
      <td>8.0</td>
    </tr>
    <tr>
      <th>asuna</th>
      <td>6.0</td>
      <td>4.0</td>
      <td>9.0</td>
      <td>5.0</td>
    </tr>
    <tr>
      <th>kelaiyin</th>
      <td>9.0</td>
      <td>NaN</td>
      <td>10.0</td>
      <td>11.0</td>
    </tr>
    <tr>
      <th>kirito</th>
      <td>0.0</td>
      <td>1.0</td>
      <td>3.0</td>
      <td>2.0</td>
    </tr>
  </tbody>
</table>
</div>

In [4]:
frame=pd.DataFrame(
    np.arange(12).reshape((4,3)),
    columns=list('bde'),
    index=['Utah','Ohio','Texas','Oregon']
)

In [5]:
series=frame.iloc[0]

In [95]:
series

b    0
d    1
e    2
Name: Utah, dtype: int32

In [7]:
frame

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>b</th>
      <th>d</th>
      <th>e</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>Utah</th>
      <td>0</td>
      <td>1</td>
      <td>2</td>
    </tr>
    <tr>
      <th>Ohio</th>
      <td>3</td>
      <td>4</td>
      <td>5</td>
    </tr>
    <tr>
      <th>Texas</th>
      <td>6</td>
      <td>7</td>
      <td>8</td>
    </tr>
    <tr>
      <th>Oregon</th>
      <td>9</td>
      <td>10</td>
      <td>11</td>
    </tr>
  </tbody>
</table>
</div>

In [8]:
frame-series

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>b</th>
      <th>d</th>
      <th>e</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>Utah</th>
      <td>0</td>
      <td>0</td>
      <td>0</td>
    </tr>
    <tr>
      <th>Ohio</th>
      <td>3</td>
      <td>3</td>
      <td>3</td>
    </tr>
    <tr>
      <th>Texas</th>
      <td>6</td>
      <td>6</td>
      <td>6</td>
    </tr>
    <tr>
      <th>Oregon</th>
      <td>9</td>
      <td>9</td>
      <td>9</td>
    </tr>
  </tbody>
</table>
</div>

In [9]:
series2=pd.Series(range(3),index=list('bef'))

In [100]:
frame+series2

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>b</th>
      <th>d</th>
      <th>e</th>
      <th>f</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>Utah</th>
      <td>0.0</td>
      <td>NaN</td>
      <td>3.0</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>Ohio</th>
      <td>3.0</td>
      <td>NaN</td>
      <td>6.0</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>Texas</th>
      <td>6.0</td>
      <td>NaN</td>
      <td>9.0</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>Oregon</th>
      <td>9.0</td>
      <td>NaN</td>
      <td>12.0</td>
      <td>NaN</td>
    </tr>
  </tbody>
</table>
</div>

In [10]:
series3=frame['d']

In [11]:
series3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: int32

In [12]:
frame.sub(series3,axis=0)

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>b</th>
      <th>d</th>
      <th>e</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>Utah</th>
      <td>-1</td>
      <td>0</td>
      <td>1</td>
    </tr>
    <tr>
      <th>Ohio</th>
      <td>-1</td>
      <td>0</td>
      <td>1</td>
    </tr>
    <tr>
      <th>Texas</th>
      <td>-1</td>
      <td>0</td>
      <td>1</td>
    </tr>
    <tr>
      <th>Oregon</th>
      <td>-1</td>
      <td>0</td>
      <td>1</td>
    </tr>
  </tbody>
</table>
</div>

In [13]:
np.abs(frame)

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>b</th>
      <th>d</th>
      <th>e</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>Utah</th>
      <td>0</td>
      <td>1</td>
      <td>2</td>
    </tr>
    <tr>
      <th>Ohio</th>
      <td>3</td>
      <td>4</td>
      <td>5</td>
    </tr>
    <tr>
      <th>Texas</th>
      <td>6</td>
      <td>7</td>
      <td>8</td>
    </tr>
    <tr>
      <th>Oregon</th>
      <td>9</td>
      <td>10</td>
      <td>11</td>
    </tr>
  </tbody>
</table>
</div>

In [14]:
frame=pd.DataFrame(np.random.randn(4,3),columns=list('bde'),index=['kirito','asuna','sikuha','sinon'])

In [15]:
frame

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>b</th>
      <th>d</th>
      <th>e</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>kirito</th>
      <td>-1.184584</td>
      <td>0.819689</td>
      <td>0.459007</td>
    </tr>
    <tr>
      <th>asuna</th>
      <td>-0.562444</td>
      <td>-0.076879</td>
      <td>-0.559072</td>
    </tr>
    <tr>
      <th>sikuha</th>
      <td>-0.322061</td>
      <td>1.123058</td>
      <td>0.989828</td>
    </tr>
    <tr>
      <th>sinon</th>
      <td>1.490052</td>
      <td>-0.339941</td>
      <td>1.312568</td>
    </tr>
  </tbody>
</table>
</div>

In [16]:
f=lambda x:x.max()-x.min()

In [17]:
frame.apply(f)

b    2.674635
d    1.462998
e    1.871640
dtype: float64

In [18]:
def f(x):
    return pd.Series([x.max(),x.min()],index=['max','min'])

In [19]:
frame.apply(f)

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>b</th>
      <th>d</th>
      <th>e</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>max</th>
      <td>1.490052</td>
      <td>1.123058</td>
      <td>1.312568</td>
    </tr>
    <tr>
      <th>min</th>
      <td>-1.184584</td>
      <td>-0.339941</td>
      <td>-0.559072</td>
    </tr>
  </tbody>
</table>
</div>

In [20]:
frame.applymap(int)

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>b</th>
      <th>d</th>
      <th>e</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>kirito</th>
      <td>-1</td>
      <td>0</td>
      <td>0</td>
    </tr>
    <tr>
      <th>asuna</th>
      <td>0</td>
      <td>0</td>
      <td>0</td>
    </tr>
    <tr>
      <th>sikuha</th>
      <td>0</td>
      <td>1</td>
      <td>0</td>
    </tr>
    <tr>
      <th>sinon</th>
      <td>1</td>
      <td>0</td>
      <td>1</td>
    </tr>
  </tbody>
</table>
</div>

In [21]:
frame=pd.DataFrame(np.arange(8).reshape((2,4)),index=['three','one'],columns=list('dabc'))

In [22]:
frame

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>d</th>
      <th>a</th>
      <th>b</th>
      <th>c</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>three</th>
      <td>0</td>
      <td>1</td>
      <td>2</td>
      <td>3</td>
    </tr>
    <tr>
      <th>one</th>
      <td>4</td>
      <td>5</td>
      <td>6</td>
      <td>7</td>
    </tr>
  </tbody>
</table>
</div>

In [23]:
frame.sort_index(axis=1)

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>a</th>
      <th>b</th>
      <th>c</th>
      <th>d</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>three</th>
      <td>1</td>
      <td>2</td>
      <td>3</td>
      <td>0</td>
    </tr>
    <tr>
      <th>one</th>
      <td>5</td>
      <td>6</td>
      <td>7</td>
      <td>4</td>
    </tr>
  </tbody>
</table>
</div>

In [24]:
frame.sort_index(axis=1,ascending=False)

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>d</th>
      <th>c</th>
      <th>b</th>
      <th>a</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>three</th>
      <td>0</td>
      <td>3</td>
      <td>2</td>
      <td>1</td>
    </tr>
    <tr>
      <th>one</th>
      <td>4</td>
      <td>7</td>
      <td>6</td>
      <td>5</td>
    </tr>
  </tbody>
</table>
</div>

In [29]:
series=pd.Series([4,7,-1,3])

In [30]:
series

0    4
1    7
2   -1
3    3
dtype: int64

In [32]:
series.sort_values(ascending=False)

1    7
0    4
3    3
2   -1
dtype: int64

In [33]:
frame=pd.DataFrame({'b':[4,7,-3,2],'a':['0','1','0','1']})

In [34]:
frame

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>a</th>
      <th>b</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>0</td>
      <td>4</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1</td>
      <td>7</td>
    </tr>
    <tr>
      <th>2</th>
      <td>0</td>
      <td>-3</td>
    </tr>
    <tr>
      <th>3</th>
      <td>1</td>
      <td>2</td>
    </tr>
  </tbody>
</table>
</div>

In [36]:
frame.sort_values(by=['b','a'],ascending=False)

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>a</th>
      <th>b</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>1</th>
      <td>1</td>
      <td>7</td>
    </tr>
    <tr>
      <th>0</th>
      <td>0</td>
      <td>4</td>
    </tr>
    <tr>
      <th>3</th>
      <td>1</td>
      <td>2</td>
    </tr>
    <tr>
      <th>2</th>
      <td>0</td>
      <td>-3</td>
    </tr>
  </tbody>
</table>
</div>

In [37]:
frame.rank()

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>a</th>
      <th>b</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1.5</td>
      <td>3.0</td>
    </tr>
    <tr>
      <th>1</th>
      <td>3.5</td>
      <td>4.0</td>
    </tr>
    <tr>
      <th>2</th>
      <td>1.5</td>
      <td>1.0</td>
    </tr>
    <tr>
      <th>3</th>
      <td>3.5</td>
      <td>2.0</td>
    </tr>
  </tbody>
</table>
</div>

In [44]:
frame.rank(method='max')

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>a</th>
      <th>b</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>2.0</td>
      <td>3.0</td>
    </tr>
    <tr>
      <th>1</th>
      <td>4.0</td>
      <td>4.0</td>
    </tr>
    <tr>
      <th>2</th>
      <td>2.0</td>
      <td>1.0</td>
    </tr>
    <tr>
      <th>3</th>
      <td>4.0</td>
      <td>2.0</td>
    </tr>
  </tbody>
</table>
</div>

In [45]:
frame.rank(method='min')

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>a</th>
      <th>b</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1.0</td>
      <td>3.0</td>
    </tr>
    <tr>
      <th>1</th>
      <td>3.0</td>
      <td>4.0</td>
    </tr>
    <tr>
      <th>2</th>
      <td>1.0</td>
      <td>1.0</td>
    </tr>
    <tr>
      <th>3</th>
      <td>3.0</td>
      <td>2.0</td>
    </tr>
  </tbody>
</table>
</div>

In [46]:
series=pd.Series(np.arange(3),index=['a','a','b'])

In [47]:
series

a    0
a    1
b    2
dtype: int32

In [48]:
series['a']

a    0
a    1
dtype: int32

In [50]:
series.index.is_unique

False

In [51]:
df=pd.DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index=['a','b','c','d'],columns=[0,1])

In [52]:
df

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>a</th>
      <td>1.40</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>b</th>
      <td>7.10</td>
      <td>-4.5</td>
    </tr>
    <tr>
      <th>c</th>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>d</th>
      <td>0.75</td>
      <td>-1.3</td>
    </tr>
  </tbody>
</table>
</div>

In [57]:
df.sum(axis=0)

0    9.25
1   -5.80
dtype: float64

In [58]:
df.sum(skipna=False)

0   NaN
1   NaN
dtype: float64

In [59]:
df.count()

0    3
1    2
dtype: int64

In [60]:
df.max()

0    7.1
1   -1.3
dtype: float64

In [63]:
df.idxmin()

0    d
1    b
dtype: object

In [64]:
df.pct_change()

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>a</th>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>b</th>
      <td>4.071429</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>c</th>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>d</th>
      <td>-0.894366</td>
      <td>-0.711111</td>
    </tr>
  </tbody>
</table>
</div>

In [65]:
df.var()

0    12.205833
1     5.120000
dtype: float64

In [67]:
df.quantile()

0    1.4
1   -2.9
Name: 0.5, dtype: float64

In [69]:
df[0]

a    1.40
b    7.10
c     NaN
d    0.75
Name: 0, dtype: float64

In [72]:
df.loc['a']

0    1.4
1    NaN
Name: a, dtype: float64

In [74]:
df[0].unique()

array([ 1.4 ,  7.1 ,   nan,  0.75])

In [86]:
series=pd.Series(np.arange(10))

In [1]:
series

NameError: name 'series' is not defined

In [88]:
series.value_counts()

9    1
8    1
7    1
6    1
5    1
4    1
3    1
2    1
1    1
0    1
dtype: int64

TypeError: '<' not supported between instances of 'list' and 'int'

In [89]:
series

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [90]:
series<1

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [95]:
series==1

0    False
1     True
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

AttributeError: 'Series' object has no attribute 'match'

In [2]:
import pandas as pd
import  numpy as np

In [3]:
df=pd.read_csv(path='E:\learning\spssModelerLearning\tantannic\titanic_train .csv',nrows=500)

TypeError: parser_f() got an unexpected keyword argument 'path'

In [ ]:
df=pd.read_csv()